#!/usr/bin/env python
# -*- coding:utf-8 -*-
from jd_assistant import Assistant

if __name__ == '__main__':
    """
    重要提示：此处为示例代码之一，请移步下面的链接查看使用教程👇
    https://github.com/tychxn/jd-assistant/wiki/1.-%E4%BA%AC%E4%B8%9C%E6%8A%A2%E8%B4%AD%E5%8A%A9%E6%89%8B%E7%94%A8%E6%B3%95
    """

    # 执行预约抢购
    # 5个参数
    # sku_id: 商品id
    # buy_time: 下单时间，例如：'2019-11-10 22:41:30.000'
    # retry: 抢购重复执行次数，可选参数，默认4次
    # interval: 抢购执行间隔，可选参数，默认4秒
    # num: 购买数量，可选参数，默认1个
    sku_ids = '56657322838:1,56655493806:1,56655493809:1,56657322841:1,100010159778:1,100010159774:1,19028117913:1,65425816569:1,10183475858:1,1835968:1,1835967:1,11609510701:1,41286382373:1,41286382376:1,41286382378:1,100009442472:1,100009445348:1,100006444236:1,100009394518:1,100005294853:1,7263128:1,7498167:1,51137726168:1,51137726169:1,851157:1,100005151507:1,100010159728:1,100010159728:1,100010159802:1,62268661448:1,7498167:1,5724402:1,100009450890:1,25411367334:1,2291586:1,1060200558:1,100006784140:1,3842341:1,4492421:1,100011294222:1,100004142807:1,100002824548:1'  # 商品id
    area = '19_1601_3633'        # 区域id
    asst = Assistant()        # 初始化
    asst.login_by_QRcode()    # 扫码登陆
    asst.buy_item_in_stock(sku_ids=sku_ids, area=area, wait_all=False, stock_interval=5)
    
